In [44]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel("Restaurant_Details.xlsx")

In [3]:
df.head()

,Rs_ID,RS_Name,RS_Location,Dish_category,Dish_Name,Dish_Price,Rs_Ratings_Received (Num.)
0,RS_1,Hotel Empire,Brigade Road,North Indian,Empire Special Chilly Kebab,120,10000.0
1,RS_1,Hotel Empire,Brigade Road,Kebabs,Popcorn Chicken Kebab,134,10000.0
2,RS_1,Hotel Empire,Brigade Road,Biryani,Grilled Chicken,210,10000.0
3,RS_1,Hotel Empire,Brigade Road,Kebabs,Empire Special Chicken Kebab,105,10000.0
4,RS_1,Hotel Empire,Brigade Road,Andhra,Bucket Chicken Biriyani,1199,10000.0

In [4]:
# pd.set_option('display.max_rows', None)

In [5]:
df["Dish_Name"] = df["Dish_Name"].str.lower()
df.head()

,Rs_ID,RS_Name,RS_Location,Dish_category,Dish_Name,Dish_Price,Rs_Ratings_Received (Num.)
0,RS_1,Hotel Empire,Brigade Road,North Indian,empire special chilly kebab,120,10000.0
1,RS_1,Hotel Empire,Brigade Road,Kebabs,popcorn chicken kebab,134,10000.0
2,RS_1,Hotel Empire,Brigade Road,Biryani,grilled chicken,210,10000.0
3,RS_1,Hotel Empire,Brigade Road,Kebabs,empire special chicken kebab,105,10000.0
4,RS_1,Hotel Empire,Brigade Road,Andhra,bucket chicken biriyani,1199,10000.0

In [6]:
df.Dish_Name.unique().shape

(12639,)

In [8]:
df.shape

(26773, 7)

In [39]:
biryani = df.loc[df['Dish_Name'].str.contains("biryani|biriyani"), 'Dish_Name']

In [40]:
biryani.shape

(1062,)

In [11]:
chinese = df.loc[df['Dish_Name'].str.contains("hakka|chilli|noodles|manchurian|schezwan|fried|spring|momo|fry|momos|roll"), 'Dish_Name']

In [12]:
chinese.shape

(3687,)

In [13]:
south = df.loc[df['Dish_Name'].str.contains("dosa|upma|utappam|vada|idli|bath|sambar|rava|podi|south|pongal|appam|benne|rasam"), 'Dish_Name']

In [14]:
south.shape

(1751,)

In [15]:
beverage = df.loc[df['Dish_Name'].str.contains("coffee|tea|milk|shake|juice"), 'Dish_Name']

In [16]:
beverage.shape

(1488,)

In [17]:
biryani.shape

(945,)

In [33]:
north = df.loc[df['Dish_Name'].str.contains("dal|north|tandoor|kadai|punjabi|shahi|kofta|naan|chole|chola|bhature|bhatura|roti|amritsari|saag|kulcha|malai|handi|matar|aloo|paratha|kebab|kabab"), 'Dish_Name']

In [34]:
north.shape

(3065,)

In [20]:
desserts = df.loc[df['Dish_Name'].str.contains("cake|mousse|cookie|pie|brownie|tiramisu|gellato"), 'Dish_Name']

In [21]:
desserts.shape

(1390,)

In [22]:
fast = df.loc[df['Dish_Name'].str.contains("burger|sandwich|nachos|pizza|tacos|pasta|mac|spaghetti|pesto|ravioli|fries|burrito|lasagne|lasagna|ravioli|american"), 'Dish_Name']

In [23]:
fast.shape

(2549,)

In [24]:
chicken = df.loc[df['Dish_Name'].str.contains("chicken"), 'Dish_Name']
chicken

1                     popcorn chicken kebab
2                           grilled chicken
3              empire special chicken kebab
4                   bucket chicken biriyani
5        bucket biriyani with chicken kabab
                        ...
26715                  chicken manchow soup
26716                   chicken wanton soup
26726              grilled chicken sandwich
26752                       chicken biryani
26764                         chicken tikka
Name: Dish_Name, Length: 4585, dtype: object

In [25]:
chicken.shape

(4585,)

In [35]:
chinese = chinese.tolist()
south= south.tolist()
# north = north.tolist()
fast = fast.tolist()
desserts = desserts.tolist()
# biryani = biryani.tolist()
beverage = beverage.tolist()

AttributeError: 'list' object has no attribute 'tolist'

In [37]:
north = north.tolist()

In [41]:
biryani = biryani.tolist()

In [45]:
def get_category(dish):
    if dish in south:
        return 'South Indian'
    elif dish in biryani:
        return 'Biryani'
    elif dish in fast:
        return 'Fast Food'
    elif dish in north:
        return 'North Indian'
    elif dish in chinese:
        return 'Chinese'
    elif dish in beverage:
        return 'Beverage'
    elif dish in desserts:
        return 'Dessert'
    else:
        return np.nan

df['Category'] = df['Dish_Name'].apply(get_category)

df.head()

,Rs_ID,RS_Name,RS_Location,Dish_Name,Dish_Price,Rs_Ratings_Received (Num.),Category
0,RS_1,Hotel Empire,Brigade Road,empire special chilly kebab,120,10000.0,North Indian
1,RS_1,Hotel Empire,Brigade Road,popcorn chicken kebab,134,10000.0,North Indian
2,RS_1,Hotel Empire,Brigade Road,grilled chicken,210,10000.0,NaN
3,RS_1,Hotel Empire,Brigade Road,empire special chicken kebab,105,10000.0,North Indian
4,RS_1,Hotel Empire,Brigade Road,bucket chicken biriyani,1199,10000.0,Biryani

In [46]:
df.isna().sum()

Rs_ID                             0
RS_Name                           0
RS_Location                       0
Dish_Name                         0
Dish_Price                        0
Rs_Ratings_Received (Num.)        0
Category                      12950
dtype: int64

In [31]:
df.drop('Dish_category', axis = 1, inplace = True)

In [32]:
df

,Rs_ID,RS_Name,RS_Location,Dish_Name,Dish_Price,Rs_Ratings_Received (Num.),Category
0,RS_1,Hotel Empire,Brigade Road,empire special chilly kebab,120,10000.000000,North Indian
1,RS_1,Hotel Empire,Brigade Road,popcorn chicken kebab,134,10000.000000,North Indian
2,RS_1,Hotel Empire,Brigade Road,grilled chicken,210,10000.000000,
3,RS_1,Hotel Empire,Brigade Road,empire special chicken kebab,105,10000.000000,North Indian
4,RS_1,Hotel Empire,Brigade Road,bucket chicken biriyani,1199,10000.000000,
...,...,...,...,...,...,...,...
26768,RS_1573,HOB-House of Bhatura,Koramangala,chole bhatura [2 pcs],160,2803.407306,
26769,RS_1573,HOB-House of Bhatura,Koramangala,extra bhatura,70,2803.407306,
26770,RS_1573,HOB-House of Bhatura,Koramangala,extra chole,70,2803.407306,
26771,RS_1573,HOB-House of Bhatura,Koramangala,extra pav,65,2803.407306,
26772,RS_1573,HOB-House of Bhatura,Koramangala,pav bhaji,125,2803.407306,

In [47]:
df.isna().sum()

Rs_ID                             0
RS_Name                           0
RS_Location                       0
Dish_Name                         0
Dish_Price                        0
Rs_Ratings_Received (Num.)        0
Category                      12950
dtype: int64

In [50]:
df = df.dropna()

In [51]:
df.isna().sum()

Rs_ID                         0
RS_Name                       0
RS_Location                   0
Dish_Name                     0
Dish_Price                    0
Rs_Ratings_Received (Num.)    0
Category                      0
dtype: int64

In [52]:
df.shape

(13823, 7)

In [53]:
df.to_excel('Swiggy Table 2.xlsx', index=False)